package com.kh.hw.view;

public class Menu {
//	1. displayMenu() 메소드에 메뉴 화면이 반복 출력되게 함
//	2. 메뉴 번호를 입력 받아 해당 번호의 기능이 실행되게 함
//	3. 메뉴 1~8번까지의 실행용 메소드는 Function클래스의 메소드 호출
//	4. 9번 입력 시 “종료합니다.” 출력 후 종료
//	5. 잘 못 입력 했을 시 “잘못 입력하셨습니다. 다시 입력해주세요.” 출력
//	
//	클래스 명 : com.kh.hw.view.Menu
//	메소드 명 : public void displayMenu(){}
//	1. 간단 계산기
//	2. 작은 수에서 큰 수까지 합계
//	3. 신상 정보 확인
//	4. 학생 정보 확인
//	5. 별과 숫자 출력
//	6. 난수까지의 합계
//	7. 구구단
//	8. 주사위 숫자 알아맞추기 게임
//	9. 프로그램 종료
//	메뉴 번호 : 1 (메뉴 1 실행)
//
//	1. 간단 계산기
//	2. 작은 수에서 큰 수까지 합계
//	3. 신상 정보 확인
//	4. 학생 정보 확인
//	5. 별과 숫자 출력
//	6. 난수까지의 합계
//	7. 구구단
//	8. 주사위 숫자 알아맞추기 게임
//	9. 프로그램 종료
//	메뉴 번호 : 10
//	잘못 입력하셨습니다. 다시 입력해주세요.
//	
//	1. 간단 계산기
//	2. 작은 수에서 큰 수까지 합계
//	3. 신상 정보 확인
//	4. 학생 정보 확인
//	5. 별과 숫자 출력
//	6. 난수까지의 합계
//	7. 구구단
//	8. 주사위 숫자 알아맞추기 게임
//	9. 프로그램 종료
//	메뉴 번호 : 9
//	종료합니다.
	public void displayMenu() {
		
	}
}
