package com.kh.hw.shape.run;

import com.kh.hw.shape.view.ShapeMenu;

public class Run {
	public static void main(String[] args) {

		// inputMenu() 호출

//		===== 도형 프로그램 =====
//		3. 삼각형
//		4. 사각형
//		9. 프로그램 종료
//		메뉴 번호 : 1
//		잘못된 번호입니다. 다시 입력하세요.
//		===== 도형 프로그램 =====
//		3. 삼각형
//		4. 사각형
//		9. 프로그램 종료
//		메뉴 번호 : 3
//		===== 삼각형 =====
//		1. 삼각형 면적
//		2. 삼각형 색칠
//		3. 삼각형 정보
//		9. 메인으로
//		메뉴 번호 : 1
//		높이 : 10
//		너비 : 3
//		삼각형 면적 : 15.0
//		===== 삼각형 =====
//		1. 삼각형 면적
//		2. 삼각형 색칠
//		3. 삼각형 정보
//		9. 메인으로
//		메뉴 번호 : 3
//		삼각형 10.0 3.0 white
//		===== 삼각형 =====
//		1. 삼각형 면적
//		2. 삼각형 색칠
//		3. 삼각형 정보
//		9. 메인으로
//		메뉴 번호 : 2
//		색깔을 입력하세요 : red
//		색이 수정되었습니다.
//		===== 삼각형 =====
//		1. 삼각형 면적
//		2. 삼각형 색칠
//		3. 삼각형 정보
//		9. 메인으로
//		메뉴 번호 : 3
//		삼각형 10.0 3.0 red
//		===== 삼각형 =====
//		1. 삼각형 면적
//		2. 삼각형 색칠
//		3. 삼각형 정보
//		9. 메인으로
//		메뉴 번호 : 9
//		메인으로 돌아갑니다.
//		===== 도형 프로그램 =====
//		3. 삼각형
//		4. 사각형
//		9. 프로그램 종료
//		메뉴 번호 : 4
//		===== 사각형 =====
//		1. 사각형 둘레
//		2. 사각형 면적
//		3. 사각형 색칠
//		4. 사각형 정보
//		9. 메인으로
//		메뉴 번호 : 1
//		높이 : 10
//		너비 : 3
//		사각형 둘레 : 26.0
//		===== 사각형 =====
//		1. 사각형 둘레
//		2. 사각형 면적
//		3. 사각형 색칠
//		4. 사각형 정보
//		9. 메인으로
//		메뉴 번호 : 2
//		높이 : 10
//		너비 : 3
//		사각형 둘레 : 26.0
//		===== 사각형 =====
//		1. 사각형 둘레
//		2. 사각형 면적
//		3. 사각형 색칠
//		4. 사각형 정보
//		9. 메인으로
//		메뉴 번호 : 2
//		높이 : 10
//		너비 : 3
//		사각형 면적 : 30.0
//		===== 사각형 =====
//		1. 사각형 둘레
//		2. 사각형 면적
//		3. 사각형 색칠
//		4. 사각형 정보
//		9. 메인으로
//		메뉴 번호 : 4
//		사각형 10.0 3.0 white
//		===== 사각형 =====
//		1. 사각형 둘레
//		2. 사각형 면적
//		3. 사각형 색칠
//		4. 사각형 정보
//		9. 메인으로
//		메뉴 번호 : 3
//		색깔을 입력하세요 : blue
//		색이 수정되었습니다.
//		===== 사각형 =====
//		1. 사각형 둘레
//		2. 사각형 면적
//		3. 사각형 색칠
//		4. 사각형 정보
//		9. 메인으로
//		메뉴 번호 : 4
//		사각형 10.0 3.0 blue
//		===== 사각형 =====
//		1. 사각형 둘레
//		2. 사각형 면적
//		3. 사각형 색칠
//		4. 사각형 정보
//		9. 메인으로
//		메뉴 번호 : 9
//		메인으로 돌아갑니다.
//		===== 도형 프로그램 =====
//		3. 삼각형
//		4. 사각형
//		9. 프로그램 종료
//		메뉴 번호 : 9
//		프로그램을 종료합니다.
		
		new ShapeMenu().inputMenu();
	}
}
