package com.kh.practice.point.run;

public class Run {
//	===== 메뉴 =====
//	1. 원
//	2. 사각형
//	9. 끝내기
//	메뉴 번호 : 1
//	===== 원 메뉴 =====
//	1. 원 둘레
//	2. 원 넓이
//	9. 메인으로
//	메뉴 번호 : 1
//	x 좌표 : 2
//	y 좌표 : 4
//	반지름 : 1
//	둘레 : 2, 4, 1 / 6.283185307179586
//	===== 메뉴 =====
//	1. 원
//	2. 사각형
//	9. 끝내기
//	메뉴 번호 : 1
//	===== 원 메뉴 =====
//	1. 원 둘레
//	2. 원 넓이
//	9. 메인으로
//	메뉴 번호 : 2
//	x 좌표 : 2
//	y 좌표 : 4
//	반지름 : 1
//	면적 : 2, 4, 1 / 3.141592653589793
//	===== 메뉴 =====
//	1. 원
//	2. 사각형
//	9. 끝내기
//	메뉴 번호 : 2
//	===== 사각형 메뉴 =====
//	1. 사각형 둘레
//	2. 사각형 넓이
//	9. 메인으로
//	메뉴 번호 : 1
//	x 좌표 : 2
//	y 좌표 : 4
//	높이 : 1
//	너비 : 3
//	둘레 : 2, 4 1 3 / 8
//	===== 메뉴 =====
//	1. 원
//	2. 사각형
//	9. 끝내기
//	메뉴 번호 : 2
//	===== 사각형 메뉴 =====
//	1. 사각형 둘레
//	2. 사각형 넓이
//	9. 메인으로
//	메뉴 번호 : 2
//	x 좌표 : 2
//	y 좌표 : 4
//	높이 : 1
//	너비 : 3
//	면적 : 2, 4 1 3 / 3
//	===== 메뉴 =====
//	1. 원
//	2. 사각형
//	9. 끝내기
//	메뉴 번호 : 3
//	종료합니다.
	public static void main(String[] args) {
		// PointMenu의 mainMenu() 실행
	}
}
