package com.kh.hw.employee.run;

import com.kh.hw.employee.view.EmployeeMenu;

public class Run {

	public static void main(String args[]) {
		EmployeeMenu em = new EmployeeMenu();
	}

//	1. 사원 추가
//	2. 사원 수정
//	3. 사원 삭제
//	4. 사원 출력
//	9. 프로그램 종료
//	메뉴 번호를 누르세요 : 1
//	사원 번호 : 1
//	사원 이름 : 홍길동
//	사원 성별 : 남
//	전화 번호 : 010-1234-5678
//	추가 정보를 더 입력하시겠습니까?(y/n) : n
//	1. 사원 추가
//	2. 사원 수정
//	3. 사원 삭제
//	4. 사원 출력
//	9. 프로그램 종료
//	메뉴 번호를 누르세요 : 4
//	1 홍길동 남 010-1234-5678 null 0 0.0
//	1. 사원 추가
//	2. 사원 수정
//	3. 사원 삭제
//	4. 사원 출력
//	9. 프로그램 종료
//	메뉴 번호를 누르세요 : 1
//	사원 번호 : 2
//	사원 이름 : 김길순
//	사원 성별 : 여
//	전화 번호 : 010-5678-1234
//	추가 정보를 더 입력하시겠습니까?(y/n) : y
//	사원 부서 : 영업부
//	사원 연봉 : 3000000
//	보너스 율 : 0.5
//	1. 사원 추가
//	2. 사원 수정
//	3. 사원 삭제
//	4. 사원 출력
//	9. 프로그램 종료
//	메뉴 번호를 누르세요 : 4
//	2 김길순 여 010-5678-1234 영업부 3000000 0.5
//	1. 사원 추가
//	2. 사원 수정
//	3. 사원 삭제
//	4. 사원 출력
//	9. 프로그램 종료
//	메뉴 번호를 누르세요 : 2
//	가장 최신의 사원 정보를 수정하게 됩니다.
//	사원의 어떤 정보를 수정하시겠습니까?
//	1. 전화 번호
//	2. 사원 연봉
//	3. 보너스 율
//	9. 돌아가기
//	메뉴 번호를 누르세요 : 3
//	수정할 보너스율 :0.15
//	1. 사원 추가
//	2. 사원 수정
//	3. 사원 삭제
//	4. 사원 출력
//	9. 프로그램 종료
//	메뉴 번호를 누르세요 : 4
//	2 김길순 여 010-5678-1234 영업부 3000000 0.15
//	1. 사원 추가
//	2. 사원 수정
//	3. 사원 삭제
//	4. 사원 출력
//	9. 프로그램 종료
//	메뉴 번호를 누르세요 : 2
//	가장 최신의 사원 정보를 수정하게 됩니다.
//	사원의 어떤 정보를 수정하시겠습니까?
//	1. 전화 번호
//	2. 사원 연봉
//	3. 보너스 율
//	9. 돌아가기
//	메뉴 번호를 누르세요 : 9
//	메인메뉴로 돌아갑니다.
//	1. 사원 추가
//	2. 사원 수정
//	3. 사원 삭제
//	4. 사원 출력
//	9. 프로그램 종료
//	메뉴 번호를 누르세요 : 3
//	정말 삭제하시겠습니까? (y/n) : y
//	데이터 삭제에 성공하였습니다.
//	1. 사원 추가
//	2. 사원 수정
//	3. 사원 삭제
//	4. 사원 출력
//	9. 프로그램 종료
//	메뉴 번호를 누르세요 : 4
//	사원 데이터가 없습니다.
//	1. 사원 추가
//	2. 사원 수정
//	3. 사원 삭제
//	4. 사원 출력
//	9. 프로그램 종료
//	메뉴 번호를 누르세요 : 9
//	프로그램을 종료합니다.
}
