package com.kh.practice.list.library.run;

import com.kh.practice.list.library.view.BookMenu;


public class Run {
//	===== Welcome KH Library =====
	
//	=====***** 메인 메뉴 *****=====
//	1. 새 도서 추가
//	2. 도서 전체 조회
//	3. 도서 검색 조회
//	4. 도서 삭제
//	5. 도서 명 오름차순 정렬
//	9. 종료
	
//	메뉴 번호 입력 : 1
//	===== 새 도서 추가 =====
//	책 정보를 입력해주세요.
//	도서 명 : 갈증에 한 수위
//	저자 명 : 헛개수
//	장르(1. 인문 / 2. 과학 / 3. 외국어 / 4. 기타) : 1
//	가격 : 15000
	
//	=====***** 메인 메뉴 *****=====
//	1. 새 도서 추가
//	2. 도서 전체 조회
//	3. 도서 검색 조회
//	4. 도서 삭제
//	5. 도서 명 오름차순 정렬
//	9. 종료
	
//	메뉴 번호 입력 : 2
//	===== 도서 전체 조회 =====
		//	(자바의 정석/남궁 성/기타/27000)
		//	(쉽게 배우는 알고리즘/문병로/기타/15000)
		//	(대화의 기술/강보람/인문/17500)
		//	(암 정복기/박신우/의료/21000)
		//	(갈증에 한 수위/헛개수/인문/15000)
	
//	=====***** 메인 메뉴 *****=====
//	1. 새 도서 추가
//	2. 도서 전체 조회
//	3. 도서 검색 조회
//	4. 도서 삭제
//	5. 도서 명 오름차순 정렬
//	9. 종료
//
//	메뉴 번호 입력 : 3
//	===== 도서 검색 =====
//	검색 키워드 : 의
		//	(자바의 정석/남궁 성/기타/27000)
		//	(대화의 기술/강보람/인문/17500)
	
//	=====***** 메인 메뉴 *****=====
//	1. 새 도서 추가
//	2. 도서 전체 조회
//	3. 도서 검색 조회
//	4. 도서 삭제
//	5. 도서 명 오름차순 정렬
//	9. 종료
	
//	메뉴 번호 입력 : 4
//	===== 도서 삭제 =====
//	삭제할 도서 명 : 갈증에 한 수위
//	삭제할 저자 명 : 헛개수
//	성공적으로 삭제되었습니다.
	
//	=====***** 메인 메뉴 *****=====
//	1. 새 도서 추가
//	2. 도서 전체 조회
//	3. 도서 검색 조회
//	4. 도서 삭제
//	5. 도서 명 오름차순 정렬
//	9. 종료
	
//	메뉴 번호 입력 : 2
//	===== 도서 전체 조회 =====
		//	(자바의 정석/남궁 성/기타/27000)
		//	(쉽게 배우는 알고리즘/문병로/기타/15000)
		//	(대화의 기술/강보람/인문/17500)
		//	(암 정복기/박신우/의료/21000)
	
//	=====***** 메인 메뉴 *****=====
//	1. 새 도서 추가
//	2. 도서 전체 조회
//	3. 도서 검색 조회
//	4. 도서 삭제
//	5. 도서 명 오름차순 정렬
//	9. 종료
//	메뉴 번호 입력 : 5
//	정렬에 성공하였습니다.
//
//	=====***** 메인 메뉴 *****=====
//	1. 새 도서 추가
//	2. 도서 전체 조회
//	3. 도서 검색 조회
//	4. 도서 삭제
//	5. 도서 명 오름차순 정렬
//	9. 종료
	
//	메뉴 번호 입력 : 2
//	===== 도서 전체 조회 =====
		//	(대화의 기술/강보람/인문/17500)
		//	(쉽게 배우는 알고리즘/문병로/기타/15000)
		//	(암 정복기/박신우/의료/21000)
		//	(자바의 정석/남궁 성/기타/27000)
	
//	=====***** 메인 메뉴 *****=====
//	1. 새 도서 추가
//	2. 도서 전체 조회
//	3. 도서 검색 조회
//	4. 도서 삭제
//	5. 도서 명 오름차순 정렬
//	9. 종료
	
//	메뉴 번호 입력 : 9
//	프로그램 종료
	public static void main(String[] args) {
		BookMenu bm = new BookMenu();
		bm.mainMenu();
	}
}